app/controllers/surveys_controller.rb

SELECT `surveys`.* FROM `surveys`
---
  def index
    if current_user.is_admin?
      @surveys = Survey.all