app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`created_at`, `email`, `is_admin`, `password_digest`, `updated_at`, `username`) VALUES ('2014-01-14 05:19:16', 'szizor@hotmail.com', NULL, '$2a$10$PXPVJ/uJJ788bnKtxp.MReVcYL5cg6Y953sXwuXDvvOT25rzsfh5C', '2014-01-14 05:19:16', 'test')

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 2